Show / Hide Table of Contents
Class ParameterInt
Integer parameter of cross-section
Inheritance
System.Object
OpenObject
Parameter
ParameterInt
Inherited Members
 Parameter.Name
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ParameterInt : Parameter
Properties
Improve this Doc   View Source
Value
Value
Declaration
public int Value { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source